9/data/attachments/3b112cff487730d5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Calvin_short_Friend_15026_2</nif:username>
            <nif:friendToBeRequested>soap_friends_023a720d-da53-4df2-83d6-81a01cdc8840</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>